posts/2016/02/09/blog_engine.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>mrroman's blog</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" type="text/css" href="/css/style.css">
</head>
<body>
<div id="content">
<h1 class="title">mrroman's blog</h1>

<div id="outline-container-orga66dafa" class="outline-2">
<h2 id="orga66dafa">Blog engine version 0.1</h2>
<div class="outline-text-2" id="text-orga66dafa">
<p>
I've started my first Guile Scheme app. It is a small generator of blog.
You can see the result this small post that I wrote here.
</p>

<p>
I thought about writing small app to learn Scheme - Lisp derivative.
I was aquainted already with Clojure (another Lisp derivative), so
parenthesis and list wasn't novelty for me, but it was not what I expected.
It wasn't bad, but it meant getting used to another idea for the development,
different toolset and libraries.
</p>

<p>
I know that there are other, more sophisticated Scheme implementations
like Racket, but Guile felt to me lighter and the module system was more
like I was used to already. There was even a HTTP client and server
in the standard library :).
</p>

<p>
GNU Guile is available almost in every Linux distribution and on MacOS X.
It is just one command to install it:
</p>

<div class="org-src-container">
<pre class="src src-shell">&lt;your apt/yum/pacman/brew&gt; install guile
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
